{
    "af": "Shortened version of the intensifier \"as fuck\".[7][8]",
    "asf": "Shortened version of the intensifier \"as fuck\".[7][8]",
    "asl": "Shortened version of \"as hell\". Unrelated to the early Internet slang for \"age/sex/location\".[8]",
    "aura": "Overall vibe, energy, or personality.[9]",
    "based[a]": "A response used to indicate that one agrees with something. It is especially common in political slang and discussions and may be used for controversial topics. Sometimes used as an antonym of \"cringe\". The word originally meant \"to be yourself and not care about how others view you\".[10]",
    "basic": "Pertaining to those who prefer mainstream products, trends, and music. Derived from the term \"basic bitch\".[11][12][13]",
    "beige flag": "Seered flag.",
    "BDE": "Abbreviation for \"big dick energy\": confidence and ease.[14]",
    "bestie": "Short for \"best friend\". Sometimes used jokingly for someone has no relationship with.[15]",
    "bet": "Yes; okay; \"it's on\".[16]",
    "bffr": "Abbreviation for \"Be fucking for real\", meaning \"be serious\" or in response to something incredible.[17]",
    "big yikes": "Used to describe something embarrassing or cringe, particularly in response to an offensive comment.[18]",
    "BBL": "Acronym for \"Brazilian Butt Lift\". The acronym was popularised onTikTok. In May 2024, hip-hop artistMetro Boominreleased a rap beat named \"BBL Drizzy\".[19]",
    "blud": "\"Friend\" or \"bro\". It is often used to describe people or animals that are out of place.[20]Derived from Jamaican slang and believed to come from the term \"blood brothers\".",
    "boujee": "High-class/materialistic. Derived frombourgeoisie.[21]",
    "bop": "Aderogatoryterm, usually for females, suggesting excessive flirtatiousness or promiscuity. The term can also be used to describe an exceptionally good song.[22][23]",
    "brainrot": "The state of losing touch with the real world as a result of consuming hyperstimulating orchronically onlinecontent, or the constant use of seemingly meaningless buzzwords (\"skibidi\", \"fanum tax\", \"rizz\", etc). Derived from the idea that one's brain would \"rot\" from consuming too much stimulating content.[24][25][26]",
    "bruh": "Term used to express shock, embarrassment, or disappointment.[27][28]",
    "bussin'": "Extremely good, excellent. Also used to describe good food. Originated from African-American vernacular for good food. Though not related, it has also been used as a derogatory term forejaculation.[29]",
    "bussy": "Portmanteau of \"boy\" and \"pussy\" (slang for thevagina). Effectively a man'sanus. (See also:-ussy)[30]",
    "cap": "To lie.[31][32]",
    "caught in 4K": "Refers to someone being indisputably caught doing something wrong or incriminating on camera or with evidence to prove it, referencing4K resolution.[33]",
    "clapback": "Swift and witty response to an insult or critique.[34]",
    "cook": "To \"cook\" is to prepare or initiate a situation with the intent of creating a result. When a person is \"cooked\", they are in the state of being in any sort of danger, physical, emotional, of failure, or of reputation.[35][36]",
    "dab": "A dance move used as a gesture of triumph. The move originated in Japanese popular culture with shows such asDragon BallandSuper Sentaibefore being adopted by rap groups in the 2010s.[37]",
    "dank": "Excellent, high-quality.[38]",
    "dead": "Humorous to such an extent as to \"kill you\". Laughter and death have been associated since Ancient Greece, where it is held thatZeuxisdied from laughing at a portrait of an ugly woman he was painting.[39][40]",
    "ded": "Humorous to such an extent as to \"kill you\". Laughter and death have been associated since Ancient Greece, where it is held thatZeuxisdied from laughing at a portrait of an ugly woman he was painting.[39][40]",
    "delusionship": "A relationship in which someone holds unrealistic or overly idealistic beliefs. A person who holds such beliefs is called a \"delulu\".[41][42][43]",
    "dogs": "Toes.[44][45][46]",
    "drip": "Trendyhigh-classfashion.[47]",
    "era": "A period of interests or priorities.[48]",
    "face card": "An attractive face.[49]Sometimes defined as never declining or receding.[50]",
    "failure management": "Term used to describe someone being helped by an adult, parent, or teacher on a subject that the user already knows well. Used to tease and taunt others. Closely related to \"skill issue.\"",
    "fire": "Term used to describe that something is impressive, good, or cool.[51]Also seelit. Alternative:flame.",
    "fit": "Term used to highlight or bring attention to one's outfit. \"Fit\" is a truncation of \"outfit\".[52]",
    "fit check": "Term used to highlight or bring attention to one's outfit. \"Fit\" is a truncation of \"outfit\".[52]",
    "finna": "Short for \"fixing to\". The term has its roots in Southern American English, where \"fixing to\" has been used to mean \"getting ready to\" since the 18th century.[53]",
    "flop": "opposite of \"bop.\"",
    "gagged": "Shocked, amazed, or at a loss for words.[54]",
    "ghost": "To end communication or contact with someone without warning.[55][56][57][58]",
    "girlboss": "A female entrepreneur who succeeds in the male-dominated business world, an empowered woman; Popularized in 2014 bySophia Amorusos's autobiography#GIRLBOSS.[59]",
    "glaze": "To hype, praise, or compliment someone so much that it becomes annoying or cringeworthy.[60][61][62]",
    "glizzy": "Ahot dog. Popularized in 2020, possibly from theWashington metropolitan area, and possibly originating from the slang term \"glizzy\" for aGlock handgun(approximately the same length as a hot dog).[63][64][65][66]",
    "glow-up": "A major improvement in one's self, usually an improvement in appearance, confidence, and style. Frequently used in a context relating topuberty. A \"glow-down\" is a situation where someone's appearance has declined.[67]",
    "GOAT": "Acronym for \"greatest of all time\".[68]",
    "gooning": "Excessive and/or prolonged masturbation. An extreme version ofedging.[69][70][71]",
    "Gucci": "Meaning good, cool, fashionable, or excellent. Used to express approval or satisfaction for something. Originated from the luxury brandGucci.[72]",
    "hit different": "To be better in a distinctive manner. Originates fromfansofYouTubersDaniel HowellandPhil Lester. In 2019, Howellcame outasgay; his fans subsequently posted clips of him and Lester together, with the term \"hits different\" in the titles. Beginning in July 2019, it spread out of the gay community.[4]",
    "huzz": "A variation of the pejorative word \"hoes\" similarly used to objectify, degrade, and/or belittle women.[73]Originated and became popular onTikTok.[74]The term gained traction with its usage and teaching by streamerKai Cenat.[75]",
    "ick": "A sudden feeling of disgust or repulsion for someone one was previously attracted to.[76]",
    "IJBOL": "An acronym for \"I just burst out laughing\".[77][78]",
    "I oop": "Used to express shock, embarrassment, and or amusement.[79]",
    "iPad kid": "Derogatory term describing late Gen Z andGeneration Alphachildren who spend most of their time staring at phone or tablet screens. The term was popularized in January 2021 after a 21-year-old TikToker criticized Millennial parents for allowing their children excessive screen time, saying, \"I need everyone else in my generation to promise that we are not going to raise 'iPad children'. ... You've been shoving media and screens in these kids' faces since birth.\" He concludes: \"Gen Z isn't allowed to raise iPad kids.\" The viral video garnered more than 525 million views on TikTok.[80]",
    "it's giving": "Used to describe an attitude or connotation.[81][82]",
    "iykyk": "Acronym for \"If you know, you know\". Used to describe inside jokes.[83]",
    "jit": "A younger person. Usually used pejoratively for someone seen as inexperienced.[84]",
    "Karen": "Pejorative term for an obnoxious, angry, or entitled White woman.[85][86][87][88]",
    "Lit": "Remarkable, interesting, fun, or amusing.[89]",
    "looksmaxxing": "An attempt (often pseudoscientific) to maximize physical attractiveness.[90]",
    "living rent-free": "Constantly being thought of negatively.[91][92][unreliable source?]",
    "main character": "Someone who is or wants to be the star of their life. Often refers to someone who wants to be the center of attention.[93][94]",
    "mew": "A pseudoscientific method to restructure someone's jawline by pressing their tongue to the roof of their mouth. Coined by controversial British dentistJohn Mewand his son, Mike, the term became popular in the late 2010s and onTikTok.[95][96][97]",
    "mid": "Average or not special. Sometimes used in a negative or insulting way.[98]",
    "moot": "Short for \"mutuals\" or \"mutual followers\".[99][100]",
    "moots": "Short for \"mutuals\" or \"mutual followers\".[99][100]",
    "mogging": "Being more attractive than others.[101][unreliable source?]",
    "Netflix and chill": "To watchNetflixwith a romantic prospect, often with the expectation of sexual activity.[102][103]",
    "NPC": "Someone who cannot think for themself and/or has no or little control over their own life, is ready to agree with popular opinion unquestioningly, and always believes what they are told. Derived fromnon-player characters (NPCs) in video games, \"NPC\" gained popularity in late 2018 around theUnited States midterm elections, when supporters of then U.S. presidentDonald Trumpused it to mock his opponents.[104]",
    "nyaa": "A cat noise, often used in contexts evoking cuteness. Derived from Japaneseonomatopoeiafor the vocalization of a domestic cat.[105]",
    "no cap": "\"This is true\"; \"I'm not lying\".[31]Seecap.",
    "Ohio": "Slang meaning for strange, weird, cringe, and dumb. Originally referred to the U.S. State ofOhio. It gained widespread popularity in 2020 as a meme that humorously labeled Ohio as a weird place where only bizarre and random things happened.[106][107]",
    "OK boomer": "Pejorative directed toward members of theBaby Boomergeneration, used to dismiss or mock attitudes typically associated with baby boomers as out of date.[108][109][110]",
    "oof": "Used to express discomfort, surprise, dismay, or sympathy for someone else's pain. Until 2022, it was also the expression of aRobloxavatar when it dies or respawns. Thus the verb \"to oof\" can mean killing anotherplayerin a game or messing up something oneself.[111][112]",
    "oomf": "Abbreviation for \"One of My Followers\".[113]",
    "opp": "Short for opposition or enemies; describes an individual's opponents. A secondary, older definition has the term be short for \"other peoples' pussy\". Originated fromstreetandgang culture.Dexertoclaims that the primary definition stems from the secondary one, which was derived from a 1991Naughty by Naturesong titled \"O.P.P.\". The initialism was derived from the acronym \"OPM\", which was used in the neighborhood the group grew up in and stood for \"other people's money\". An example of the term being used in popular culture is also in theGangsta rapscene, withYBN Nahmirand his song \"Opp Stoppa\". Dictionary.com implies that the origins for the two meanings had little to do with each other.[114]",
    "out of pocket": "To be crazy, wild, or extreme, sometimes to an extent that is considered too far.[3][115]",
    "owned": "Used to refer to defeat in a video game, or domination of an opposition. Also less commonly used to describe defeat in sports. Originated in the 1990s as a term used to describe hackers gaining administrative control over another person's computer.[116][117][unreliable source?]",
    "periodt": "Used as an interjection to indicate that the preceding statement is final and that there is nothing more to be said about it; similar to the British term \"full stop\". Originated as \"period\" in the early 1900, spread in the 2010s via theCity Girlsrap duo andBlack Twitter, and entered into the mainstream by 2019. The addition of the T stems from a common trend in Black English where T is used as a replacement for D.[118]",
    "pick-me": "Someone who seeks validation by trying to stand out, often putting down others in their gender or group to gain favor or attention.[119][120][121]",
    "pluh": "Used as a conversation stopper when there is nothing left to say.[122]",
    "pookie": "An endearing nickname for a close friend or lover. Originates from a German term of endearment in the 1900s. Also used as apet name.[123][124][125]",
    "queen": "A person (usually female) deemed impressive or praiseworthy. Originates from the noun term \"queen\" which is used to describe a person of high importance and royalty, in this case, someone who did something of importance that \"slayed\".[126]",
    "rank": "A contraction of 'rancid', it is used to describe something disgusting, especially a smell.[citation needed]",
    "ratio": "When a post, particularly on Twitter, receives more replies thanretweetsand likes combined. It can also been used for when a reply has better reception and more likes than the original post being replied to. Originates from the mathematical term \"ratio\" which compares the quantitative relationship between a set of numbers.[126]",
    "red flag": "A warning sign indicating behaviors or characteristics within a relationship that may potentially be harmful or toxic. Oppositely, a green flag indicates positive aspects or healthy behaviors. The use of the term red flag as a warning traces back to the 18th century. Historically, red flags were used as signals during wars or battles to indicate danger.[127][128]The term green flag comes from the use of green-colored flags indicating permission to proceed. The concept of 'beige flags' has gained popularity to represent behaviors that are neither positive nor negative, but rather depend on individual preferences or boundaries.[129]",
    "rizz": "One's charm/seductionskills. Derived from charisma.[130]",
    "Roman Empire": "A random event, person, incident, or thing that fascinates or intrigues one to the point that one is frequently thinking about it. Originated in 2023 after influencer Saskia Cort encouraged herInstagramfollowers to ask their male partners how often they thought about theRoman Empire, to which many answered quite often. The term spread internationally and evolved to mean something that frequently occupies one's thoughts. It has also morphed into a joke about how often people think about/mention the Roman Empire.[131]",
    "salty": "Used to describe someone who is behaving or expressing themselves in a resentful, bitter, or irritated manner. Originally referred to \"racy\" or \"vulgar\" sailors in the 1800s.[132]",
    "secure the bag": "The act of someone working to reach their goals, usually referring to making money. Started in hip-hop culture and used as the opposite of the phrase \"fumble the bag\". The phrase first appeared onUrban Dictionaryin 2017. Likely popularized by songs with the same title byGucci ManeandLil Uzi Vert.[133][unreliable source?]",
    "sheesh": "To praise someone when they are doing something good. The vowels are often emphasized, as in \"sheeesh\". The one being praised is to do the \"ice in my veins\" pose popularized by Basketball playerD'Angelo Russell. Believed to be a variation of another word such as \"jeez\", \"Jesus\", or \"shit\". First used in 1955 as a word to express \"disappointment, annoyance or surprise\".[31][134][135]",
    "shook": "To be shocked, surprised, or bothered. Became prominent inhip-hopstarting in the 1990s, when it began to be used as a standalone adjective for uncontrollable emotions. One famous example isMobb Deep's 1995 singleShook Ones, Part II. See alsoshooketh.[136][137]",
    "sigma": "An independent male on top of the social hierarchy. From the Greek letter, sigma (Σ), often used above A (as Latin S) in numerical tier lists.[138]",
    "simp": "Sycophancy, being overly affectionate in pursuit of a sexual relationship.[139][140]",
    "situationship": "Refers to an ambiguous romantic relationship where all parties have mutual feelings for one another, but said feelings are not clearly defined; a mid-point between dating and not dating.[141][142][143][144][145][146][147]",
    "skibidi": "Nonce word, is often used for a comedic or exaggerating effect. FromSkibidi Toilet.[148][149][150]",
    "sksksk": "Used to convey happiness/laughter. A form ofkeysmashing. The earliest known usage is by Brazilian users on Twitter. Used by various British, African-American, and gay communities before becoming associated withstan Twitterin 2019. Became associated withVSCO girls. Similar forms can be found regionally, like the Indonesian \"Wkwkwk\" or the Korean \"kkkk\".[151][152]",
    "slaps": "Used to refer to something that is perceived to be good, particularly used when referring to music.[153]",
    "slay": "To do something well.[154]",
    "snatched": "Amazing, attractive, or flawlessly styled. Sometimes used to particularly describe a person as having a narrow waist.[155][unreliable source?][156]",
    "stan": "Supporting something to an extreme degree. Specifically used in cases of overzealous or obsessive support of celebrities.[157][158]",
    "sus": "Short term for suspect/suspicious. Popularized in 2018 by players of the online video gameAmong Usand received mainstream usage with the game's explosion in popularity in mid-2020 amidst theCOVID-19 pandemic.[159]According toMerriam-Webster, the term has been in use among English speakers since at least the 1960s.[160]",
    "sussy baka": "A combination of \"sus\" and \"baka\", the Japanese word for \"fool\". Stemmed fromTikTokerAkeam Francis.[161]",
    "skill issue": "Refers to a situation where a person's lack of ability or proficiency is seen as the cause of their failure or difficulty in completing a task.[162]",
    "tea": "Secret information or rumors. Originates fromBlackdrag cultureof the 1990s. The letter \"t\" stood for \"truth\". \"Spilling the tea\" means to share gossip or rumors.[81][163]",
    "touch grass": "A way of telling someone to \"go outside\", usually after said person is believed to have been online for too long. Believed to have originated in 2015, before experiencing a resurgence in 2020–2021.[164][165]",
    "tweaking": "To be acting strangely or thinking that someone is hallucinating.[166][167]",
    "unalive": "Aeuphemismfor the word \"kill\" or otherdeath-related terms, often in the context ofsuicide. This word is often used to circumvent social media algorithms, especiallyTikTok, fromcensoringor demonetizing content that involves death-related terms.[168]",
    "understood the assignment": "To understand what was supposed to be done; to do something well. Popularized by American rapperTay Money's 2021 song \"The Assignment\". She posted a video on TikTok stating that she \"understood the assignment\".[169]",
    "uwu": "Used to portray happiness or one wanting to appear cute. Used more or less as an expression. Became popular in the 2000s. The expression is commonly associated withfurries,femboys, andanimefandoms.[27][170][171]",
    "valid": "Seen as socially acceptable. Gained prominence in Tumblr (and later, TikTok) discourse regarding the acceptability of a given behavior, person, or thing.[172]",
    "vibe check": "To check one's personality or attitude.[173][174]",
    "VSCO girl": "A stereotypical white girl who often takes trendy and \"basic\" pictures of themself to later edit and post online. Named afterVSCO, a photography app released in 2011. The term \"VSCO girl\" originated in late 2018 and was popularized in 2019 on social media platforms such as TikTok where it became a trendyInternet aesthetic.[175][176]The phrase has since fallen out of popularity in late 2019.[177]",
    "wig": "To do something so well as to \"make one's wig fly off\". Unrelated towig out. Originated fromBlack LGBT ballroom culture. American singerKaty Perryis generally credited with propagating the word into the mainstream after using it to compliment a contestant onAmerican Idolin 2018.[178]",
    "who is this diva?": "An affectionate rhetorical question used to compliment people who positively embodydiva-like qualities such as boldness, style, and/or confidence.[179]Sometimes used with a purple heart emoji at the end.[180]Originated fromTikTok.[181]",
    "yap": "To talk too much; To say many words without the words meaning anything. Speculated to be used as early as 1592 to express annoyance and irritation. Became aTikToktrend in 2023 for someone who talks too much, or whose talking does not make sense.[182]",
    "yeet": "To throw something with force and without regard. Also used as a generic positive exclamation.[13][183]"
}